In [3]:
import numpy as np
import pandas as pd
from pandas import  DataFrame, Series

In [5]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                    'k2':['alpha','beta','alpha','beta','alpha'],
                    'dataset1':np.random.randn(5),
                    'dataset2':np.random.randn(5)})
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.808359  1.940099
1  X   beta  0.560320  0.161309
2  Y  alpha  1.727021  0.196150
3  Y   beta -0.275374  0.207853
4  Z  alpha -1.158501  0.821280

In [9]:
group1 = dframe['dataset1'].groupby(dframe['k1'])
group1

In [12]:
group1.mean

In [13]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.808359  1.940099
1  X   beta  0.560320  0.161309
2  Y  alpha  1.727021  0.196150
3  Y   beta -0.275374  0.207853
4  Z  alpha -1.158501  0.821280

In [14]:
group1 = dframe['dataset1'].groupby(dframe['k1'])
group1

In [17]:
group1.mean()

k1
X    0.684339
Y    0.725823
Z   -1.158501
Name: dataset1, dtype: float64

In [19]:
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB    0.560320
    JAN    1.727021
NY  FEB   -0.275374
    JAN   -0.175071
Name: dataset1, dtype: float64

In [20]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha  0.808359  1.940099
1  X   beta  0.560320  0.161309
2  Y  alpha  1.727021  0.196150
3  Y   beta -0.275374  0.207853
4  Z  alpha -1.158501  0.821280

In [21]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X   0.684339  1.050704
Y   0.725823  0.202002
Z  -1.158501  0.821280

In [22]:
dframe.groupby('k1','k2').mean()

ValueError: No axis named k2 for object type <class 'pandas.core.frame.DataFrame'>

In [23]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha  0.808359  1.940099
   beta   0.560320  0.161309
Y  alpha  1.727021  0.196150
   beta  -0.275374  0.207853
Z  alpha -1.158501  0.821280

In [27]:
dframe.groupby(['k1','k2'])[['dataset2']].mean()

          dataset2
k1 k2
X  alpha  1.940099
   beta   0.161309
Y  alpha  0.196150
   beta   0.207853
Z  alpha  0.821280

In [30]:
dframe.groupby('k1')[['dataset2']].mean()

    dataset2
k1
X   1.050704
Y   0.202002
Z   0.821280

In [31]:
dframe.groupby('k1').size()

k1
X    2
Y    2
Z    1
dtype: int64

In [33]:
for name, group in dframe.groupby('k1'):
    print('This is the {} group'.format(name))
    print(group)
    print('\n')

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha  0.808359  1.940099
1  X   beta  0.560320  0.161309


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha  1.727021  0.196150
3  Y   beta -0.275374  0.207853


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha -1.158501   0.82128